Tekla Open API Reference for Tekla Structures 2025
AnalysisPartEnd Properties
The AnalysisPartEnd type exposes the following members.
Properties
Name | Description
Condition
 The condition of the part end.
Connectivity
 The connectivity of the part end.
Eccentricity
 The eccentricity of the part end (in the local coordinate system).
EccentricityMode
 The eccentricity mode of the part end.
Support
 The support of the part end.
SupportCoordSystem
 The coordinate system of the support.
Top
See Also
Reference
AnalysisPartEnd Class
Tekla.Structures.Analysis Namespace